<a href="https://colab.research.google.com/github/18wh1a0590/MachineLearning-Lab/blob/main/18WH1A0590_Program02.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [5]:
!pip install db-sqlite3
import sqlite3

Requirement already satisfied: db-sqlite3 in /usr/local/lib/python3.7/dist-packages (0.0.1)
Requirement already satisfied: db in /usr/local/lib/python3.7/dist-packages (from db-sqlite3) (0.1.1)
Requirement already satisfied: antiorm in /usr/local/lib/python3.7/dist-packages (from db->db-sqlite3) (1.2.1)

In [11]:
conn = sqlite3.connect ('expr.db')
cur = conn.cursor()
print ("DB Created Successfully")

DB Created Successfully

In [12]:


conn.execute('''CREATE TABLE COMPANY1
         (ID INT PRIMARY KEY     NOT NULL,
         NAME           TEXT    NOT NULL,
         AGE            INT     NOT NULL,
         ADDRESS        CHAR(50),
         SALARY         REAL);''')
print ("Table created successfully");

Table created successfully

In [14]:
conn.execute("INSERT INTO COMPANY1 (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (1, 'Paul', 32, 'Texas', 20000.00 )");

conn.execute("INSERT INTO COMPANY1 (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (2, 'Perry', 27, 'Houston', 15000.00 )");

conn.execute("INSERT INTO COMPANY1 (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (3, 'Berry', 25, 'Hawai', 20000.00 )");

conn.execute("INSERT INTO COMPANY1 (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (4, 'Terry', 31, 'Rich-Mond ', 65000.00 )");

conn.commit()
print ("Records created successfully");

Records created successfully

In [15]:
for row in conn.execute('select * from COMPANY1'):
        print(row)

(1, 'Paul', 32, 'Texas', 20000.0)
(2, 'Perry', 27, 'Houston', 15000.0)
(3, 'Berry', 25, 'Hawai', 20000.0)
(4, 'Terry', 31, 'Rich-Mond ', 65000.0)